2013/migratie 2013-02-13/migr-isc/bin/jbossesb-4.10-cp1-installer/samples/quickstarts/publish_as_webservice_inonly/error-soap-message.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
			xmlns:xsd="http://www.w3.org/2001/XMLSchema"
			xmlns:say="http://www.jboss.org/sayHi">
  <soap:Body>
      <say:sayHi><say:arg0>Error</say:arg0></say:sayHi>
  </soap:Body>

</soap:Envelope> 
