2013/migratie 2013-02-13/migr-isc/bin/jbossesb-4.10-cp1-installer/samples/quickstarts/publish_as_webservice/soap-userpass-message.xml

<soap:Envelope 
			xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
			xmlns:xsd="http://www.w3.org/2001/XMLSchema"
			xmlns:say="http://www.jboss.org/sayHi" 
			xmlns:cust="http://www.jboss.org/custom-request" 
			xmlns:sub="http://www.jboss.org/custom-subtype" 
			xmlns:t="http://www.jboss.org/type2">
  <soap:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd">
      <wsse:UsernameToken>
        <wsse:Username>kermit</wsse:Username>
        <wsse:Password>thefrog</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>

  <soap:Body>

 <say:sayHi>

	<say:arg0>HelloWorld</say:arg0>

    <cust:customType>
           <cust:type>Some text</cust:type>
           <sub:subType>
               <sub:type>Some more text</sub:type>
               <t:type2>
                   <t:type>Even more text</t:type>
               </t:type2>
           </sub:subType>
    </cust:customType>

 </say:sayHi>

  </soap:Body>

</soap:Envelope> 
